<template>
	<view class="fanhui" @tap="fanhui"><text>{{'<'}} 返回</text></view>
	<view class="page" style="white-space: pre-line;">
	  <view v-if="flag1">
	    <view style="text-align: center;">
	      <text style="font-size:22px;font-weight:700;display:block;position: relative;">奶茶店用户隐私政策议</text><br />
	      <text style="font-size:12px;font-weight:200;display:block;position: relative;">版本更新日期：2023年12月27日</text>
	      <text style="font-size:12px;font-weight:200;display:block;position: relative;">版本生效日期：2023年12月27日</text>
	    </view>
	    <text>
	    【特别提示】请您在使用我们提供的各项服务前，仔细阅读并充分理解本隐私政策（重点内容我们以黑体加粗或加下划线的形式提示您重点注意）并作出相应选择。一旦您选择使用或继续使用我们的服务，即意味着您同意我们按照本隐私政策处理您的相关信息。如对本隐私政策有任何疑问，您可以通过本隐私政策“八、如何联系我们”中提供的方式与我们联系）。
	
	    请您注意，不同应用的功能可能存在一定的差异，具体以您实际使用的功能为准。此外，针对某些特定的服务，我们还将制定单独的隐私政策，向您说明这些服务的特殊政策。如相关特定的隐私政策与本隐私政策有不一致之处，适用相关特定隐私政策。
	
	    请您注意，本隐私政策不适用于您通过我们的服务而接入的其他第三方产品/服务(“其他第三方”包括您的交易相对方、任何第三方网站以及第三方服务提供者等)，具体规定请参照该第三方的隐私政策或类似声明。我们建议您在接受相关服务和提供个人信息前阅读并确认理解该等隐私政策。
	
	
	
	    一、我们如何收集和使用您的个人信息
	
	    在您使用我们的服务时，我们可能在以下场景收集和使用您的个人信息，其中的个人敏感信息我们以下划线的形式标记：
	
	
	
	    （一）基本功能
	
	    为了向您提供我们服务的基本功能，我们需要收集、使用必要的个人信息，如您拒绝提供该等必要信息，您将无法正常使用我们的服务。我们会遵循正当、合法、必要的原则，出于本隐私政策所述的下列目的收集和使用您的个人信息。
	
	
	
	    1、帮助您创建账号并登陆
	
	    为遵守法律法规的规定，以及向您提供更便捷的服务，在您注册成为蜜雪冰城用户时，您需要提供手机号码以创建奶茶店账号，并完善相关的网络身份识别信息（如头像、昵称及登录密码等）；若您以其他方式关联登录，我们会向关联第三方请求您的个人信息，对于我们要求但第三方无法提供的个人信息，我们仍可能会要求您提供：（1）当您使用微信账号登录时，我们会获取您的微信头像、昵称、性别和地区信息；（2）当您使用QQ账号登录时，我们会访问获取您的QQ头像、昵称、地区和性别信息；（3）当您使用支付宝账号登录时，我们会获取您的支付宝昵称、头像、性别和地区；（4）当您使用微博账号登录时，我们会获取您的微博昵称、头像；（5）当您使用Apple ID登录时，我们会获取您Apple ID的电子邮箱地址。为了确保账号安全和落实网络实名制，在您使用其他方式关联登录、使用某些功能时，您可能仍然需要绑定有效的手机号码。如果您仅需使用浏览、搜索等功能，您无需注册成为我们的用户以及提供上述信息。
	
	    在提供账号信息的过程中，如果您愿意额外补充如下个人信息，将有助于我们向您提供更为便捷的服务：包括您的性别、生日。如果您选择不提供以上信息，也不会影响您享受我们服务的基本功能。
	
	
	
	    2、向您提供基于地理位置的信息展示
	
	    当您通过系统授权开启移动设备的定位功能并使用基于位置提供的服务时，我们会收集和使用您的位置信息以便为您匹配附近的奶茶店门店信息。我们会使用有关技术获取您的位置信息（准确度会有所不同），这些技术包括IP地址、GPS以及能够提供相关信息的WLAN（如Wi-Fi）接入点、蓝牙和基站等。您可以在移动设备的系统中关闭定位服务停止我们对您所在位置信息的收集，但可能因此无法使用我们基于地理位置为您提供的服务，或者无法达到相关服务的预期效果。
	
	
	
	    3、为您提供预订、下单、订单管理功能
	
	    为向您展示您账户的订单信息及便于您对订单信息进行管理，我们会收集您在使用我们服务过程中产生的订单信息；如果您选择的配送方式为外卖，我们还需要收集联系人姓名、性别、手机号、和地址，以便于您的订单能够安全准确送达并完成。
	
	    您在应用生成的订单中，将可能包含您的身份信息、联络信息、支付信息等，请您谨慎向他人展示或对外提供，我们也会在展示订单信息时，在保证信息可用性的基础上尽量去标识化处理。
	
	
	
	    4、为您提供代邮寄功能
	
	    当您在应用上使用代邮寄（例如兑换或购买周边商品）服务或功能时，您需要提供收货人的姓名、联系电话、地址，以便于您的订单能够安全准确送达并完成。您还可以选择为常用地址加注标签（如家、公司等），便于此后的查找使用。如您拒绝授权我们收集和处理您的上述信息，您将无法使用本功能服务，但不影响您正常使用其他功能。
	
	
	
	    5、帮助您完成支付
	
	    您在应用上进行订单支付时，您可以选择使用关联的第三方合作机构（如微信支付、支付宝等合作方）所提供的服务进行支付。我们需要收集您的订单信息、对账信息及其他法律要求的必要信息并与这些合作机构共享，以确认您的支付指令并帮助您完成支付。如您拒绝授权我们收集和处理您的上述信息，您将无法使用本功能服务，但不影响您正常使用其他功能。
	
	
	
	    6、为您提供客服和售后服务
	
	    当您与我们的客服取得联系时，我们的系统可能会记录您与客服之间的通讯记录，以及使用您的账号信息以便核验身份；当您需要我们提供与您订单相关的客户服务时，我们可能会查询您的相关订单信息以便给予您适当的帮助和处理；当您需要客服协助您修改有关信息（如联系方式等）时，您可能还需要提供上述信息以外的其他信息以便完成修改。有关上述信息的收集和使用规则如下：
	
	    （1）当您因订单问题与其他产品/服务提供方之间产生纠纷时，经您授权我们会调取并使用相关录音信息作为解决纠纷的参考依据。
	
	    （2）我们将切实保障通话双方的隐私安全，并将通话录音上传至蜜雪冰城服务器保存，通话双方无法自行下载、调取或播放录音。除以下情形外，我们不会将通话录音提供给任何人（包括通话主、被叫方）：a.有权机关依法定程序调取；b.被录音的一方持司法机关出具的法律文件依法调取。
	
	    如您拒绝授权我们收集和处理您的上述信息，您将无法使用本功能服务，但不影响您正常使用其他功能。
	
	
	
	    7、广告促销
	
	    为了提升您的消费体验，我们可能会通过短信等其他方式向您发送关于我们的产品、服务、促销活动的信息。如果您不希望收到我们发送的促销短信，您可以随时选择拒绝接受我们的短信，根据短信中的操作提示，选择“退订”功能，我们不会因此收取任何额外的费用。
	
	
	
	    8、为您提供安全保障
	
	    在符合法律法规规定的情形下，为了保障您的账户安全、交易安全以及系统运行安全，在您使用我们服务的过程中，经您授权我们会获取您的设备信息，包括您使用的设备属性、连接和状态信息，例如设备型号、唯一设备标识符（如IMEI/androidID/IDFA/OPENUDID/GUID、SIM卡、IMSI、BSSID、SSID信息等）、设备MAC地址、软件列表、电信运营商等。
	
	    为提高您在使用服务过程中的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会使用或整合您的个人信息以及我们的关联方、其他相关方取得您授权或者依法共享的信息。根据您的使用习惯和常用软件信息等来综合判断您的账号及交易风险，包括验证身份，预防、发现、调查可能存在的欺诈、网络病毒、网络攻击等安全风险以及违反我们或关联方协议、政策或规则等行为，以保护您、其他用户、我们和关联方的合法权益，并记录一些我们认为有风险的链接(“URL”)。
	
	
	
	    9、我们自动收集的个人信息
	
	    当您登录后使用我们提供的服务时，我们会收集您的浏览、搜索记录等信息并作为有关网络日志进行保存，包括您的IP地址、浏览器的类型、使用的语言、操作系统的版本、访问的日期和时间、发布的信息、浏览、搜索、网络请求等。收集该等信息主要为了保障服务的安全运行，也可以使我们更好地了解您，比如您来自哪里以及我们的服务有哪些吸引您的内容。我们将该等信息用于内部分析，以及为您提升服务质量和服务相关性。我们同时也需要留存相应的日志来记录我们应用的运行状态，以符合中国法律法规的规定。
	
	
	
	    10、我们可能间接收集的个人信息
	
	    为完成身份核验，保障账号安全，确认交易状态及为您提供售后与争议解决等目的，经您授权后我们可能会从第三方获取您的个人信息（例如通过您选择的交易对象和交易直接涉及的第三方信息系统、支付机构等收集与交易进度相关的您的交易、支付等信息，以便于我们处理您的订单并保证服务的顺利完成，或者更好地预防诈骗、刷单等恶意行为）。我们会依据法律法规的要求以及与第三方的约定，经您授权后向蜜雪冰城的关联方及其他相关方获得您的有关信息，并对其信息来源的合法性进行确认后使用您的这些信息。
	
	
	
	    11、自启动或关联启动的必要性说明
	
	    当您使用我们的软件在线更新功能时，在软件更新完成后我们使用了App自启动功能（仅限安卓版本），以便于您在更新后及时使用我们的软件；
	
	    为了便于您在完成支付后能够及时回到应用界面，在您完成微信、支付宝的支付动作后，我们会调用手机系统的自启动或关联启动行为（仅限安卓版本），以确保您可以及时查看支付状态和订单信息。
	  </text>
	  </view>
	  <view v-if="flag2">
	    <view style="text-align: center;">
	      <text style="font-size:22px;font-weight:700;display:block;position: relative;">用户服务协议</text><br />
	      <text style="font-size:12px;font-weight:200;display:block;position: relative;">最近更新日期：2021年 12 月 27 日</text>
	    </view>
	
	    <text>
	      欢迎您注册奶茶店用户账号并使用奶茶店的服务！
	
	      本《奶茶店用户服务协议》（以下简称“本服务协议”）是您与奶茶店之间就注册奶茶店用户账号及使用奶茶店的各项服务等相关事宜所订立的协议。为使用奶茶店的服务，您应当仔细阅读并遵守本服务协议下的全部内容，特别是涉及免除或者责任限制的条款，该类条款可能以黑体加粗或加下划线的形式提示您重点注意。除非您已阅读并接受本服务协议所有条款，否则您将不能注册奶茶店用户账号或使用奶茶店的服务，如您不同意本服务条款的任意内容，请勿注册或使用奶茶店的服务，并应立即停止注册程序。如您对本服务协议的内容（特别是涉及免除或者责任限制的条款）有任何疑义，可随时按照本服务协议中列明的联系方式与我们联系，我们将根据您的要求为您进一步解释和说明相关内容。如您勾选“已阅读并同意《奶茶店用户服务协议》”并通过注册程序或其他任何方式使用或接受奶茶店的任何服务，即视为您已阅读并同意本服务协议，自愿接受本服务协议所有内容的约束。请您在决定注册或使用服务前再次确认您已知悉并完全理解本服务协议的所有内容。
	
	      如果您未满18周岁，请务必在您的父母或者其他监护人的陪同下阅读本服务协议，并在进行注册、下单、支付等任何行为或使用奶茶店的其他任何服务前，应事先征得您的父母或者其他监护人的同意。
	
	      本服务协议所述“服务”既包括您使用奶茶店用户账号接受奶茶店平台相关商家、个人所提供的服务，亦包括在某些特定的业务类别下您使用奶茶店用户账号向其他商家、个人或其他主体提供服务的情形。无论“服务”属于上述何种情形，本《奶茶店用户服务协议》都将予以适用。
	
	      一、协议的主体与范围
	
	      【签约主体】视您所使用的具体服务而定，“奶茶店”是指奶茶店旗下运营或提供您所使用的相关具体服务的相关主体的统称，您可在相关服务的具体服务条款或说明文件中查看上述主体的名称和信息。“用户”是指使用奶茶店相关服务的使用人，在本服务协议中更多称呼为“您”。
	
	      【协议内容】本服务协议内容同时包括：
	
	      （1）本《奶茶店用户服务协议》；
	
	      （2）《奶茶店用户隐私政策》：奶茶店非常重视您的个人信息和隐私的保护，将按照《奶茶店用户隐私政策》中所公布的政策在具体服务中进行隐私及个人信息的收集、存储、使用、披露等活动。您在注册奶茶店账号前，应仔细阅读《奶茶店用户隐私政策》；
	
	      （3）具体服务的服务条款：您的奶茶店用户账号一经注册，即可凭该账号按规定享受奶茶店平台上的各项丰富的服务。为更好地向您提供各项服务，奶茶店平台针对具体的服务制定了专门的服务条款，供服务各方遵守。您可在【相关具体服务的网站、页面或应用程序】中查阅并下载此类专门服务条款。您在使用具体服务前，应仔细阅读该服务所适用的服务条款，您注册奶茶店账号并利用奶茶店账号使用具体服务即表示您已同时接受该等服务条款，并将受该等服务条款的约束；
	
	      （4）专项商品或服务规则。为更好地提升用户体验，奶茶店在若干具体专项商品或服务中特别制定了详细的规则，供各方遵守。
	
	      （5）第三方服务相关的用户授权协议。为方便您在使用奶茶店平台服务的同时，根据您自身需要，通过蜜雪冰城平台进行跳转等方式，自愿选择接受独立第三方服务商及部分关联第三方服务商所提供的服务，您将在使用该等第三方服务前对相应的用户授权协议予以同意确认，以作为您和奶茶店平台之间就该等第三方服务的使用所涉及的相关事项的权利义务依据。
	
	      上述各项内容之间如存在不一致之处，以最新发布的内容为准，发布时间相同的，以本款【协议内容】中所包含的组成部分的序号倒序排列为准。
	
	      【协议遵守】您理解并同意：
	
	      （1）上述【协议内容】中所述的协议、政策、条款与规则构成本服务协议不可分割的组成部分，共同适用于您所使用的蜜雪冰城平台服务。
	
	      （2）根据国家法律法规变化、运营需要或为提升服务质量的目的，蜜雪冰城将在必要的时候对上述各项协议、条款与规则不时地进行修改更新，并通过在网站、客户端以及相关微信开放平台账号或小程序上发出公告、站内信等合理、醒目的方式通知您，上述修改更新内容将在相关更新说明中指定的日期开始实施。
	
	      （3）您应当及时查阅并了解相关更新修改内容，如您不同意相关更新修改内容，可停止使用相关更新修改内容所涉及的服务，此情形下，变更事项对您不产生效力；如您在上述更新修改内容实施后继续使用所涉及的服务，将视为您已同意各项更新修改内容。
	
	      【适用平台】本服务协议适用于网页端、移动客户端（包括iOS、安卓及已有或未来将新增的任何其他移动客户端）等各类平台或媒介中蜜雪冰城所提供的各项服务。您知悉并理解，为享受上述相关服务，您必须自行提供相关上网设备（如：个人电脑、手机、平板电脑或其他设备）并自行负担相关网络使用和商品服务所产生的有关费用。
	
	      二、账号的注册
	
	      【注册资料】您应遵循诚实信用、合法善意的原则，向蜜雪冰城提交相关注册资料，相关注册资料应当符合法律法规的规定并遵循社会主义制度、国家利益、公民合法权益、公序良俗、信息真实等原则，不应提交任何违法或不良信息，相关资料如有变动，您应及时更新。如因您所提供的注册资料不合法、不真实、不准确或未及时更新，从而导致相关法律责任或不利后果的，将由您自行承担。您已知悉，在蜜雪冰城用户账号注册过程中，因安全性、内部管理等原因，部分初始注册资料可能将无法再次更改。因此，您应谨慎核查此部分注册资料，确保正确填写。
	
	      【民事行为能力】您知悉并承诺，您具有完全民事权利能力和民事行为能力或虽不具有完全民事权利能力和民事行为能力但已经过您的父母或者其他监护人同意并由您的父母或者其他监护人代理注册及使用蜜雪冰城的各项服务。若您不具备前述相适应的条件即进行账号注册的，则您及您的父母或者其他监护人应依照法律规定承担因此而导致的一切后果。
	
	      【真实身份】因国家法律法规、监管要求及特定门类的服务（如金融服务等）需要，您有可能需要在注册或使用该等服务的特定环节中填写真实的身份信息，并需通过相关验证流程后方可使用该等服务，如您填写的身份信息不完整、不真实或未通过验证，将导致您无法使用该等服务并可能损害自身、他人利益或造成其他不利后果，该等后果将由您自行承担。
	
	      【注册信息保护】蜜雪冰城将对您所提交的注册信息予以保护，不会将其披露给任何非关联的第三方，除非：
	
	      （1）相关法律法规或国家机关要求；
	
	      （2）蜜雪冰城发生相关合并、分立、收购或资产转移；
	
	      （3）为提供相关服务所必须的对于您所提交的注册信息中涉及个人信息的内容，蜜雪冰城将严格按照《蜜雪冰城用户隐私政策》的规定进行收集、处理和使用。
	
	      【账号数量】除因历史原因、业务整合等蜜雪冰城所认可的特殊情况外，蜜雪冰城原则上只允许您使用一个蜜雪冰城用户账号。如有证据证明或蜜雪冰城有理由相信您存在不当注册或不当使用多个蜜雪冰城用户账号的情形，蜜雪冰城可将相关账号信息进行合并或采取其他合理措施，如因您不当注册或不当使用给蜜雪冰城及相关方造成损失的，您还应承担相应的赔偿责任。
	
	      三、账号的使用
	
	      【账号登录】您可以使用注册账号时填写登记的并获得系统审核通过的账号密码登录蜜雪冰城平台。为了您的使用便利，蜜雪冰城将适时提供指纹识别、人脸识别等更为安全便捷的登录方式，蜜雪冰城可根据相关法律法规、监管要求、用户体验、风险控制等因素对登录方式予以适时调整或增减，或在具体业务门类的用户服务条款等规定中予以进一步细化或调整。
	
	      【账号使用】您应对您账号项下的所有行为（包括但不限于在线签署任何协议，浏览、购买、支付、点评、上传、发布、输入任何内容）所产生的一切后果负责，通过您的账号所发生的上述各项行为将视为您本人的真实意思表示。
	
	      蜜雪冰城提示您，您通过自身账号在接受蜜雪冰城的各项服务中所上传、发送的任何内容都应具有合法来源，如相关内容涉及任何第三方的合法权益，应事先获得相应的许可。如蜜雪冰城收到涉及您的相关举报或投诉，蜜雪冰城可采取相关法律法规所要求或允许的方式，向相关争议方、相关部门提供包括账号在内的必要信息，以便解决纠纷争议，保护正当权利人的合法权益。
	
	      【账号借用】为保证相关账号安全，未经蜜雪冰城的书面同意，您不应将蜜雪冰城平台上所注册的账号借给他人使用，否则您应当承担由此产生的全部责任并赔偿因此给蜜雪冰城造成的所有损失，同时，蜜雪冰城保留拒绝提供相应服务、冻结或收回注册账号或终止本服务协议的权利。
	
	      【安全义务】如您发现您的账号存在安全问题，请您立即联系蜜雪冰城予以调查处理，否则您应承担损失扩大部分的责任。
	
	      蜜雪冰城特别提示您，您应该妥善保管您的账号和密码，当您使用完毕蜜雪冰城的服务后，您应安全退出。此外，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意蜜雪冰城有关防范诈骗犯罪的提示。您知悉并同意，如您在账号信息的保管上、相关上网设备的网络安全维护上存在任何过失或过错导致账号丢失、泄露的，您应对此所产生的全部后果负责，蜜雪冰城对此不负任何责任，如因此给蜜雪冰城造成损失的，蜜雪冰城将有权向您追偿。
	
	      【限制冻结】您知悉并同意，在符合法律法规的规定，或经国家机关要求的前提下，蜜雪冰城有权对您的注册账号进行限制或冻结，在该等情况下，您可能无法继续登陆或使用您的注册账号。
	
	      四、用户行为规范与责任承担
	
	      【用户义务】您知悉并承诺，在使用蜜雪冰城所提供的服务过程中，您应遵守相关法律法规的规定，不应从事如下违反法律法规规定，影响蜜雪冰城提供正常服务或损害他人合法利益的行为：
	
	      （1）不应利用蜜雪冰城平台或相关服务危害国家安全、破坏政治稳定、泄露国家秘密，不侵犯国家、社会、集体利益和第三方的合法权益，不从事违法犯罪活动，不设立用于实施诈骗，传授犯罪方法，制作或者销售违禁物品、管制物品等违法犯罪活动的网站、通讯群组，不利用网络发布涉及实施诈骗，制作或者销售违禁物品、管制物品以及其他违法犯罪活动的信息；
	
	      （2）不应制作、发布、复制、查阅和传播、存储、链接下列信息：反对《中华人民共和国宪法》所确定的基本原则的；危害国家安全，泄露国家秘密，颠覆国家政权，推翻社会主义制度，煽动国家分裂，破坏国家统一的；损害国家荣誉和利益的；煽动民族仇恨、民族歧视，破坏民族团结的；破坏国家宗教政策，宣扬邪教和封建迷信的；煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；捏造、散布谣言，侵犯他人权利，扰乱经济、社会秩序，破坏社会稳定的；散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；侮辱或者诽谤他人，侵害他人合法权益的；宣扬恐怖主义、极端主义的；违背当地风俗习惯的；含有法律法规禁止的其他内容的；</text>
	  </view>
	  <view v-if="flag3" style="text-align: center;">
	    <image src="../../components/imgs/许可证1.jpg" mode="" />
	  </view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				flag1 : false,
				flag2 : false,
				flag3 : false
			}
		},
		methods: {
			fanhui(){
			  wx.navigateBack({
			    delta: 0,
			  })
			},
		},
		/**
		 * 生命周期函数--监听页面加载
		 */
		onLoad(options) {
		  const app = getApp();
		  let app_userInfo = app.globalData.app_userInfo;
		  if (app_userInfo === null) {
		      this.lingquan = "../loginx/loginx",
		      this.deliverPath = "../loginx/loginx",
		      this.navigatorWay = "redirect"
		  } else {
		      this.lingquan = "../list/list",
		      this.deliverPath = "../list/list",
		      this.navigatorWay = "switchTab"
		  };
		},
		/**
		 * 生命周期函数--监听页面加载
		 */
		onLoad(options) {
		  this.flag1 = JSON.parse(options.flag1),
		  this.flag2 = JSON.parse(options.flag2),
		  this.flag3 = JSON.parse(options.flag3)
		},
	}
</script>

<style>
	/* pages/mycontent/mycontent.wxss */
	.page{
	  padding-top: 150rpx;
	}
	
	.fanhui{
	  margin-top: 70rpx;
	  color: skyblue;
	}
</style>